Repository: LipaQuick/LipaQuick_Mobile
Catalog: lib/l10n/app_*.arb
Languages: rw

# choose_language
source: Chosen Language
rw: Hitamo Ururimi

source: On-Boarding
rw: Gutangiza

source: Get Started
rw: Tangira

# haveAccount
source: Already have an Account?
rw: Ufite Konti?

source: Welcome
rw: Murakaza Neza

# register
source: Don't have an account,
rw: Nta konti ufite,

# register_here
source: Sign Up
rw: Iyandikishe

# user_name_hint
source: Phone Number/Email
rw: Nimero ya Telefone/Imeyili

# password_hint
source: Password
rw: Ijambo ry’Ibanga

# old_password_hint
source: Old Password
rw: Ijambo ry’Ibanga rya Kera

# new_password_hint
source: New Password
rw: Ijambo ry’Ibanga Rishya

# forgot_password_hint
source: Forgot Password
rw: Wibagiwe Ijambo ry’Ibanga

# login_button_text
source: Login
rw: Injira

# first_name_hint
source: First Name
rw: Izina rya Mbere

# last_name_hint
source: Last Name
rw: Izina rya Nyuma

# email_hint
source: Email
rw: Imeyili

# phone_hint
source: Phone
rw: Telefoni

# dob_hint
source: DOB
rw: Itariki y’Amavuko

source: ID Number
rw: Indangamuntu

source: Confirm Password
rw: Emeza Ijambo ry’Ibanga

source: Sign Up Now
rw: Iyandikishe Ubu

source: Trusted by Users
rw: Byizerwa n’Abakoresha

source: Already have an account,
rw: Usanzwe ufite konti,

source: Login Here
rw: Injira Hano

source: Step 1
rw: Intambwe 1

source: Step 2
rw: Intambwe 2

source: Step 3
rw: Intambwe 3

source: Step 4
rw: Intambwe 4

source: Gender
rw: Igitsina

source: Male
rw: Gabo

source: Female
rw: Gore

# other
source: Others
rw: Ibindi

# btn_next
source: Next
rw: Komeza

source: ID Type
rw: Ubwoko bw’Indangamuntu

# id_photo
source: Identity Photo
rw: Ifoto y’Indangamuntu

source: Street
rw: Umuhanda

source: Referral Code
rw: Kode y’Uhamagarira

# referral_code_hint
source: Enter or Paste your Referral Code here.
rw: Andika cyangwa Shyira Kode y’Uhamagarira hano.

# referral_code_validation
source: Please enter Referral Code.
rw: Shyiramo Kode y’Uhamagarira.

# term_conditions
source: I agree to the Terms and Conditions, Privacy Policy and Content Policy
rw: Nemeye Amategeko n’Amabwiriza, Politiki y’Ibanga na Politiki y’Ibirimo

source: Registration
rw: Iyandikisha

source: Error
rw: Ikosa

# validation_password_characters
source: Password has at least 8 characters
rw: Ijambo ry’ibanga rigomba kuba rifite nibura inyuguti 8

# validation_password_lowercase
source: Password must contain at least one lowercase letter
rw: Ijambo ry’ibanga rigomba kuba rifite inyuguti nto nibura imwe

# validation_password_uppercase
source: Password must contain at least one uppercase letter
rw: Ijambo ry’ibanga rigomba kuba rifite inyuguti nkuru nibura imwe

# validation_password_digit
source: Password must contain at least one digit
rw: Ijambo ry’ibanga rigomba kuba rifite umubare nibura umwe

# validation_password_symbol
source: Password must contain at least one symbol (*@#$)
rw: Ijambo ry’ibanga rigomba kuba rifite ikimenyetso (*@#$)

# validation_street
source: Please enter street.
rw: Shyiramo umuhanda.

# validation_select_id_hint
source: Select your ID-Card
rw: Hitamo Indangamuntu yawe

# validation_id_photo
source: Select your ID-Card
rw: Hitamo Ifoto y’Indangamuntu yawe

# validation_pick_image_msg
source: You have not yet picked an image.
rw: Ntabwo uratoranya ifoto.

# validation_identity_error
source: Invalid value has been entered, please enter valid {hint}
rw: Icyo washyizemo ntabwo gikwiye, Shyiramo {hint} ikwiye

# validation_first_name
source: Please enter first name.
rw: Shyiramo izina rya mbere.

# validation_last_name
source: Please enter last name.
rw: Shyiramo izina rya nyuma.

# validation_email
source: Please enter email.
rw: Shyiramo imeyili ikwiye.

# validation_email_valid
source: Please valid email address.
rw: Shyiramo imeyili ikwiye.

# validation_phone
source: Please enter phone number.
rw: Shyiramo numero ya telefoni.

# validation_phone_valid
source: Please enter valid phone number.
rw: Shyiramo numero ya telefoni ikwiye.

# validation_dob
source: Please select your DOB.
rw: Hitamo Itariki y’Amavuko.

# validation_id_number
source: Please enter ID number.
rw: Shyiramo numero y’indangamuntu.

# validation_confirm_password
source: Please enter confirm password.
rw: Shyiramo ijambo ry’ibanga ryemeza.

# validation_password_not_matched
source: Password do not match, please check your passwords again.
rw: Ijambo ry’ibanga ntirihuye, ongera usuzume amagambo yawe y’ibanga.

# validation_phone_email_empty
source: Please enter phone number or email.
rw: Shyiramo numero ya telefoni cyangwa imeyili.

# validation_phone_email_valid
source: Please enter valid phone number or email.
rw: Shyiramo numero ya telefoni cyangwa imeyili ikwiye.

# validation_password_empty
source: Please enter password.
rw: Shyiramo ijambo ry’ibanga.

# validation_password_valid
source: Please enter valid password.
rw: Shyiramo ijambo ry’ibanga rikwiye.

# invalid_login_credentials
source: Invalid username or password, Please enter valid login credentials
rw: Izina cyangwa ijambo ry’ibanga ntabwo bikwiye, shyiramo ibisobanuro byo kwinjira bikwiye

# login_successful_msg
source: Login successful
rw: Winjiye neza

# otp_page_title
source: OTP Verification
rw: Kugenzura OTP

# otp_number_verified
source: Your number has been successfully verified. Press OK to continue.
rw: Numero yawe yagenzuwe neza. Kanda OK kugira ngo ukomeze.

# success_hint
source: Success
rw: Byakunze

# enter_otp_hint
source: Verify Mobile
rw: Emeza Telefoni

# sent_verification_hint
source: Enter 6 digit code we have sent
rw: Shyiramo kode y’imirongo 6 twakwohereje

# button_continue
source: Continue
rw: Komeza

# no_otp_recevied_hint
source: Haven't received verification code?
rw: Ntabwo wakiriye kode y’ubugenzuzi?

# button_resend_hint
source: Resend Code
rw: Ohereza Kode Indi

# resend_otp_hint
source: Resend Code in {time} seconds.
rw: Ongera wohereze Kode nyuma ya {time} amasegonda.

# invalid_otp_msg
source: We could not verify your phone number, Please try again.
rw: Ntabwo twashoboye kugenzura numero yawe ya telefoni, ongera ugerageze.

# account_number_hint
source: Account Number
rw: Nimero ya Konti

source: Re-Enter Account Number
rw: Ongera ushyiremo Nimero ya Konti

# account_holder_name
source: Account Holder's Name
rw: Izina rya Nyiri Konti

# select_bank_hint
source: Select Your Bank
rw: Hitamo Banki yawe

# swift_code_hint
source: Enter Swift Code
rw: Shyiramo Kode ya Swift

# recipient_account_number_hint
source: Recipient Account Number
rw: Numero ya Konti y’Uwishyurwa

# recipient_account_holder_name
source: Recipient Name
rw: Izina ry’Uwishyurwa

# recipient_select_bank_hint
source: Select recipient's bank
rw: Hitamo banki y’uwishyurwa

# recipient_swift_code_hint
source: Recipient Swift Code
rw: Kode ya Swift y’Uwishyurwa

# transfer_confirm_title
source: Please confirm the details of your transfer:
rw: emeza dusobanura ibijyanye n’ohereza yawe:

# bank_name_hint
source: Bank Name
rw: Izina rya Banki

# confirm_pay_hint
source: Confirm and Pay
rw: Emeza Wishyure

# card_number_hint
source: Card Number
rw: Nimero ya Karita

source: Re-Enter Card Number
rw: Ongera ushyiremo Nimero ya Karita

# expired_date
source: Expiry Date
rw: Itariki y’Isozwa

# card_holder_name_hint
source: Card Holder Name
rw: Izina rya Nyir’Karita

# validation_hint
source: Please enter {hint}.
rw: Shyiramo {hint}.

# add_account_title
source: Add Bank Account
rw: Shyiraho Konti ya Banki

# set_default_message
source: Set this as your default account.
rw: Shyira iyi nka konti yawe isanzwe

# error_hint
source: Error
rw: Ikosa

# user_account_hint
source: Your Account
rw: Konti yawe

# bank_account_hint
source: Bank Account
rw: Konti ya Banki

# something_went_wrong_hint
source: Something is right here, please check back again.
rw: Ikintu ntabwo gikwiye hano, ongera usuzume.

# go_back_hint
source: Go Back
rw: Subira Inyuma

# empty_bank_account_hint
source: No Banks Accounts are Linked.
rw: Nta Konti ya Banki yashyizweho.

# add_account_hint
source: Add Bank Account
rw: Shyiraho Konti ya Banki

# set_as_default_hint
source: Set As Default
rw: Shyira nka Konti ya Default

# delete_hint
source: Delete
rw: Siba

# default_account_delete_hint
source: This is primary account linked to the account. Please choose another default account, and then delete this account.
rw: Iyi ni konti yibanze ihujwe na konti. Hitamo indi konti yibanze, hanyuma usibe iyi konti.

# session_time_out_hint
source: Oop''s seems you session has timed out. Please login to continue
rw: Ooops! Igihe cyawe cyarangiye. Winjire kugira ngo ukomeze

# banks_not_found_hint
source: No Bank Found
rw: Nta Banki Zabonywe

# select_bank_account_hint
source: Select Your Bank
rw: Hitamo Konti yawe ya Banki

# add_card_title
source: Add Card
rw: Shyiraho Karita

# add_new_card_title
source: Add New Card
rw: Shyiraho Karita Nshya

# expiry_date_title
source: Expiry Date
rw: Itariki y’Isozwa

# expiry_date_error_hint
source: Please select your expiry date
rw: Hitamo itariki y’isozwa

# cards_title
source: Your Cards
rw: Amakarita yawe

# cards_error_title
source: Cards
rw: Amakarita

# no_cards_added
source: No Cards are Linked. Press ADD CARDS to link your card.
rw: Nta Karita Zashyizweho. Kanda SHYIRA KARITA kugira ngo wongere karita yawe.

# remove_card_hint
source: Remove Card
rw: Kuraho Karita

# dropdown_more_hint
source: More
rw: Ibindi

# chat_title
source: Chat
rw: Ibiganiro

# no_recent_chat_hint
source: No Recent Chats
rw: Nta Kiganiro cyaherukaga

# start_chat_hint
source: Start Chat
rw: Tangiza Ikiganiro

# reload_hint
source: Reload
rw: Ongera Urebe

# payment_paid_title
source: Paid to {currency}{amount}
rw: Yishyuwe {currency}{amount}

# payment_received_title
source: Received From {currency}{amount}
rw: Yakiriwe Avuye kuri {currency}{amount}

# search_title
source: Search
rw: Gushakisha

# try_again_hint
source: Try Again
rw: Gerageza

# no_contact_hint
source: No contacts found.
rw: Nta contact yabonetse

# validation_format_hint
source: Please enter valid {hint}.
rw: Injiza {hint} yemewe.

# merchat_title
source: Merchant
rw: Umucuruzi

# send_money_title
source: Send Money
rw: Ohereza Amafaranga

# amount_title
source: Amount
rw: Umubare

# discount_applied
source: Discount applied {discount_code}.
rw: Igabanyirizwa ryakoreshejwe {discount_code}.

# discount_saving
source: Discount saving {amount}.
rw: kugabanyirizwa {amount}.

source: Apply Discount
rw: Koresha Igabanyirizwa

# enter_amount
source: Please enter amount.
rw: Injiza umubare w'amafaranga.

# pay_title
source: Pay
rw: Iyishyure

# select_bank_accout
source: Please select your bank account.
rw: Hitamo konti ya banki.

# logout_title
source: Logout
rw: Sohoka

# logout_msg
source: Do you want to logout?
rw: Urashaka gusohoka?

# btn_yes
source: Yes
rw: Yego

# btn_no
source: No
rw: Oya

source: Settings
rw: Igenamiterere

source: Language
rw: Ururimi

# notification
source: Notifications
rw: Amakuru

# invite_message
source: I am inviting you to use LipaQuick, a simple and easy payment application. Here''s my code-{code} just enter while creating a account. On your first payment,you will get a cashback
rw: Ndakutumira gukoresha LipaQuick, porogaramu yoroshye kandi yihuse yo kwishyura. Dore kode yanjye-{code}, jya uyikoresha mu kurema konti.

# nav_profile
source: My Profile
rw: Umwirondoro Wanjye

# nav_merchant
source: Nearby Merchant
rw: Abacuruzi Hafi

# nav_history
source: Transaction History
rw: Amakuru y'Ibikorwa

# nav_invite
source: Invite a friend
rw: Tumira Inshuti

# nav_settings
source: Settings
rw: Igenamiterere

# nav_more
source: More
rw: Ibindi

# nav_logout
source: Logout
rw: Sohoka

# nav_profile_transactions
source: Transactions
rw: Ibikorwa

# nav_profile_transactions_hint
source: Your transactions
rw: Ibikorwa byawe

# nav_profile_accounts
source: Accounts
rw: Konti

# nav_profile_accounts_hint
source: Your linked bank accounts
rw: Konti za banki zihujwe

# nav_profile_cards
source: Cards
rw: Amakarita

# nav_profile_cards_hint
source: Your linked cards
rw: Amakarita zawe zahujwe

# nav_profile_privacy
source: Privacy
rw: Ubuzima bwite

# nav_profile_privacy_hint
source: Update details and password
rw: Hindura ibisobanuro n'ijambo ry'ibanga

# nav_profile_payment
source: Payment
rw: Kwishyura

# nav_profile_payment_hint
source: Update payment settings
rw: Hindura uburyo bwo kwishyura

# nav_profile_notification
source: Notification
rw: Amakuru

# nav_profile_notification_hint
source: Change notification settings
rw: Hindura uburyo bw'amatangazo

# nav_profile_logout
source: Log out
rw: Sohoka

# nav_profile_logout_hint
source: Exit the app and clear your session
rw: Sohoka muri LipaQuick no gusiba session

# no_internet
source: Could not connect to the internet, Please check your network.
rw: Ntibyakunze guhuza na interineti, Reba uko umuyoboro uhagaze.

# transaction_history_empty
source: You have not performed any transactions.
rw: Nta bikorwa byakozwe.

# transaction_code
source: Transaction Code : {tran_code}
rw: Kode y'Ibikorwa : {tran_code}

# hint_sent_to
source: Sent To: {sent}
rw: Byoherejwe kuri: {sent}

# hint_received_from
source: Received From: {received}
rw: Byakiriwe kuri: {received}

# transfer_money_title
source: Transfer Money
rw: Ohereza Amafaranga

source: Transfer Confirmation
rw: Kwemeza Kohereza

# button_send_now
source: Send Now
rw: Ohereza Ubu

# button_retry
source: Retry
rw: Ongeraho

# from_hint
source: From
rw: Uva kuri

# to_hint
source: To
rw: Ugera kuri

# transfer_amount_hint
source: Transfer Amount
rw: Umubare woherejwe

# service_charge_hint
source: Service Charge
rw: Ikiguzi cya serivisi

# service_commission_hint
source: Commission
rw: Komisiyo

# total_amount_hint
source: Total Amount
rw: Umubare wose

# change_password_title
source: Change Password
rw: Hindura Ijambo ry'Ibanga

# change_password_success_msg
source: You password had been updated successfully, Please login to continue.
rw: Ijambo ry'ibanga ryahinduwe neza, Injira kugirango ukomeze.

source: Un-Verified Account
rw: Konti itemewe

# un_verified_account_msg
source: The user account has not been verified. Payment cannot be initiated to un-verified users.
rw: Konti y'umukoresha ntiyemejwe. Kwishyura ntibishobora gukorwa kuri konti itemewe.

# scan_qrcode_title
source: Scan QR Code
rw: Soma QR Code

# adjust_qrcode_msg
source: Adjust QR code into the green box.
rw: Shyira QR Code mu kadirishya k'icyatsi.

# error_controller_not_ready
source: QR processor is still get reading.
rw: QR processor nabwo iri gukora.

# permission_denied
source: Camera Access Permission Denied.
rw: Uburenganzira bwo kwifashisha camera yanze.

source: Enable App Lock
rw: Emeza Kubika LipaQuick

# payment_methods_title
source: Payment Method
rw: Uburyo bwo Kwishyura

# default_payment_hint
source: Default Payment Method
rw: Uburyo bwo Kwishyura bwa Default

# payment_methods_not_found
source: No payment methods has been linked to this account. Please link your payment method.
rw: Nta buryo bwo kwishyura wahujwe na konti. Ongera uburyo bwo kwishyura.

source: Add Payment
rw: Ongeraho Kwishyura

# create_app_pin
source: Create App Lock Pin
rw: Hanga PIN

# pin_create_success
source: App lock pin created successfully
rw: PIN yaremwe neza

# enter_valid_pin
source: Invalid App Lock Pin
rw: PIN idakwiye

# enter_app_lock_pin
source: Enter your App Lock Pin
rw: Shyira PIN yawe

source: Edit Quick Actions
rw: Hindura Ibikorwa Byihuse

source: Update Quick Actions
rw: Vugurura Ibikorwa Byihuse

# enable_disable_quick
source: Enable-Disable quick actions
rw: Emeza-Cyangwa Hindura Ibikorwa Byihuse

source: Social Post
rw: Ibyo ku Mbuga Rusange

source: No social post found
rw: Nta byanditswe ku mbuga rusange byabonetse

# forgot_password_title
source: Account Recovery
rw: Kugarura Konti

# forgot_password_success_msg
source: You password had been updated successfully, Please login to continue.
rw: Ijambo ry'ibanga ryahinduwe neza, Injira kugirango ukomeze.
